app/controllers/newsletters_controller.rb

  def create
  	@newsletter = Newsletter.new newsletter_params
  	if @newsletter.save
---
INSERT INTO "newsletters" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-14 00:46:04.874499"], ["email", "email"], ["name", "name"], ["updated_at", "2014-10-14 00:46:04.874499"]]